БухЭксп/InformationRegisters/CW_СтатусОбработкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусОбработкиЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработкиПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭлектронныеПисьмаДляОтправки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПризнакОтправкиПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакОтправкиПоЭлектроннойПочте</Name>
			<Comment>была ли успешная отправка</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОтправкиПоЭлектроннойПочте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПолучателейЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПолучателейЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытаяКопия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОбработкиПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОбработкиПочтовыхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыСравнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыСравнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыОбъединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыОбъединения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>И</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЛИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОтправкиПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОтправкиПоЭлектроннойПочте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭлектронныеПисьмаДляОтправки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыПолучателейЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображаемоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MIME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИдентификатор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_УчетныеЗаписиЭлектроннойПочты</Name>
			<Comment>Учетные записи электронной почты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераPOP3</Name>
					<Comment>Адрес сервера POP3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераSMTP</Name>
					<Comment>Адрес сервера SMTP</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>Таймаут по запросу почты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль для доступа к POP3 серверу.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Comment>Пароль для доступа к SMTP серверу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь POP3 сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Comment>Пользователь SMTP сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Comment>Порт POP3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Comment>Порт SMTP</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияSMTP</Name>
					<Comment>Признак аутентификации по SMTP</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3SMTP</Name>
					<Comment>Использовать параметры получения почты (POP3)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалениеССервера</Name>
					<Comment>Удалять письма с сервера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POPSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLIMAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьОтправленныеПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/_ЭП/Ext/Module.bsl
Функция ПолучитьПрофильPOP3(УчетнаяЗапись) Экспорт
	// --- 
	
	// Инициализация параметров учетной записи...
	//-------------------------------------------
	ИПП = Новый ИнтернетПочтовыйПрофиль;
	
	ИПП.АдресСервераPOP3	= УчетнаяЗапись.АдресСервераPOP3;
	ИПП.Пользователь		= УчетнаяЗапись.Пользователь;
	ИПП.Пароль				= УчетнаяЗапись.Пароль;
	ИПП.ИспользоватьSSLPOP3 = УчетнаяЗапись.POPSSL;
	_сф.УстановитьПоУсловию(ИПП.ПортPOP3,УчетнаяЗапись.ПортPOP3);
		
	Возврат(ИПП);
	
	// --- 
КонецФункции

Функция ПолучитьПрофильSMTP(УчетнаяЗапись) Экспорт 
	// --- 
	
	// профиль...
	//-----------
	ИПП = Новый ИнтернетПочтовыйПрофиль;
	ИПП.АдресСервераSMTP = СокрЛП(УчетнаяЗапись.АдресСервераSMTP);
	_сф.УстановитьПоУсловию(ИПП.ПортSMTP,УчетнаяЗапись.ПортSMTP);
	ИПП.ИспользоватьSSLSMTP = УчетнаяЗапись.SMTPSSL;
	
	Если УчетнаяЗапись.АутентификацияSMTP Тогда
		
		ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		ИПП.ПользовательSMTP = СокрЛП(УчетнаяЗапись.ПользовательSMTP);
		ИПП.ПарольSMTP = СокрЛП(УчетнаяЗапись.ПарольSMTP);
		
	Иначе
		
		ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		
	КонецЕсли; 
	
	ИПП.ВремяОжидания = 20;
	
    Возврат(ИПП);
	
	// --- 
КонецФункции  

Функция ПолучитьПрофильIMAP(УчетнаяЗапись) Экспорт 
	
	// профиль...
	//-----------
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	ПочтовыйПрофиль.АдресСервераIMAP 	= СокрЛП(УчетнаяЗапись.АдресСервераIMAP);
	ПочтовыйПрофиль.ПортIMAP 			= СокрЛП(УчетнаяЗапись.ПортIMAP);
	ПочтовыйПрофиль.ИспользоватьSSLIMAP = УчетнаяЗапись.ИспользоватьSSLIMAP;
	
	Если УчетнаяЗапись.АутентификацияSMTP Тогда  
		ПочтовыйПрофиль.ПарольIMAP 			= УчетнаяЗапись.ПарольSMTP;
		ПочтовыйПрофиль.ПользовательIMAP 	= СокрЛП(УчетнаяЗапись.ПользовательSMTP);
	Иначе
		ПочтовыйПрофиль.ПарольIMAP 			= УчетнаяЗапись.Пароль;
		ПочтовыйПрофиль.ПользовательIMAP 	= СокрЛП(УчетнаяЗапись.Пользователь);
	КонецЕсли;
	
	ПочтовыйПрофиль.ВремяОжидания = 20;
	
    Возврат ПочтовыйПрофиль;
	
КонецФункции


// ---------------------------------------------------------------------------- 

// пустая структура или на основании письма из очереди на отправку
Функция СтруктураПисьма(Источник=Неопределено) Экспорт 
	// --- 
	
	// по умолчанию пустая структура
	Если Источник=Неопределено Тогда
		
		СП = Новый Структура;
		СП.Вставить("Кодировка","UTF-8");
		СП.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Обычная);
		СП.Вставить("Категории", "");
		// --- 
		СП.Вставить("Отправитель",Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка()); // учетная запись ЭП (!!!)
		// адреса - массив из структур адреса (Адрес-ОтображаемоеИмя)
		СП.Вставить("ОбратныеАдреса",Новый Массив); // необязательный
		СП.Вставить("Получатели",Новый Массив);
		СП.Вставить("Получатели_Копии",Новый Массив);
		СП.Вставить("Получатели_СкрытыеКопии",Новый Массив);
		// --- 
		СП.Вставить("Тема","");
		СП.Вставить("Тексты",Новый Массив); // значение - структура Текст-ТипТекста-Кодировка
		СП.Вставить("Вложения",Новый Массив); // значение - структура ИмяФайла-ТипАдреса-Адрес
		
		Возврат(СП);
		
	КонецЕсли; 
	
	// заполнение по письму на отправку
	Если ТипЗнч(Источник)=Тип("СправочникСсылка.CW_ЭлектронныеПисьмаДляОтправки")
		ИЛИ ТипЗнч(Источник)=Тип("СправочникОбъект.CW_ЭлектронныеПисьмаДляОтправки") Тогда
		
		СП = Новый Структура;
		СП.Вставить("Кодировка","UTF-8");
		СП.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Обычная);
		СП.Вставить("Категории", "");
		// --- 
		СП.Вставить("Отправитель",Источник.Отправитель);
		// --- 
		СП.Вставить("ОбратныеАдреса",Новый Массив); // в очереди обратных адресов пока нет TODO
		// --- 
		СП.Вставить("Получатели",Новый Массив);
		Для каждого СтрАдрес Из Источник.Получатели.Выгрузить(Новый Структура("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Получатель)) Цикл
			
			Если СокрЛП(СтрАдрес.Адрес) <> "" Тогда
				СП.Получатели.Добавить(СтруктураАдреса(СтрАдрес.Адрес,СтрАдрес.ОтображаемоеИмя));
			КонецЕсли;
			
		КонецЦикла;
		// --- 
		СП.Вставить("Получатели_Копии",Новый Массив);
		Для каждого СтрАдрес Из Источник.Получатели.Выгрузить(Новый Структура("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Копия)) Цикл
			
			Если СокрЛП(СтрАдрес.Адрес) <> "" Тогда
				СП.Получатели_Копии.Добавить(СтруктураАдреса(СтрАдрес.Адрес,СтрАдрес.ОтображаемоеИмя));
			КонецЕсли;
			
		КонецЦикла;
		// --- 
		СП.Вставить("Получатели_СкрытыеКопии",Новый Массив);
		Для каждого СтрАдрес Из Источник.Получатели.Выгрузить(Новый Структура("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.СкрытаяКопия)) Цикл
			
			Если СокрЛП(СтрАдрес.Адрес) <> "" Тогда
				СП.Получатели_СкрытыеКопии.Добавить(СтруктураАдреса(СтрАдрес.Адрес,СтрАдрес.ОтображаемоеИмя));
			КонецЕсли; 
			
		КонецЦикла;
		// --- 
		СП.Вставить("Тема",Источник.Тема);
		// ----------------------------------------------------------------------------  
		СП.Вставить("Тексты",Новый Массив); // значение - структура Текст,ТипТекста,Кодировка или просто текст
		Для каждого СтрТекст Из Источник.Тексты Цикл
			
			СтруктураТекста = Новый Структура;
			СтруктураТекста.Вставить("Текст",СтрТекст.Текст);
			Если СокрЛП(СтрТекст.ТипТекста)<>"" Тогда
				СтруктураТекста.Вставить("ТипТекста",СтрТекст.ТипТекста);
			КонецЕсли; 
			Если СокрЛП(СтрТекст.Кодировка)<>"" Тогда
				СтруктураТекста.Вставить("Кодировка",СтрТекст.Кодировка);
			КонецЕсли; 
			СП.Тексты.Добавить(СтруктураТекста);
			
		КонецЦикла; 
		// ----------------------------------------------------------------------------  
		СП.Вставить("Вложения",Новый Массив);
		Для каждого Вложение Из Источник.Вложения Цикл
			// --- 
			
			НС = ПолучитьНавигационнуюСсылку(Источник,"Вложения.Вложение",Источник.Вложения.Индекс(Вложение));
			ДобавитьВложение(СП,Вложение.ИмяФайла,"ссылка",НС);
			
			// --- 
		КонецЦикла;
		// ---------------------------------------------------------------------------- 
		
		Возврат(СП);
		
	КонецЕсли; 
		
	// --- 
КонецФункции

// формирует элемент справочника "письма для отправки" по структуре письма
Функция ПисьмоОбъектПоСтруктуре(СП) Экспорт 
	// --- 
	
	ПисьмоОбъект = Справочники.CW_ЭлектронныеПисьмаДляОтправки.СоздатьЭлемент();
	// --- 
	ПисьмоОбъект.Дата 			= ТекущаяДата();
	ПисьмоОбъект.Отправитель 	= СП.Отправитель;
	ПисьмоОбъект.Тема 			= СП.Тема;
	
	Если СП.Свойство("СсылкаНаОбъект") Тогда
		ПисьмоОбъект.СсылкаНаОбъект = СП.СсылкаНаОбъект;
	КонецЕсли;

	// --- 
	Для каждого СА Из СП.Получатели Цикл
		
		Нстр = ПисьмоОбъект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,СА);
		Нстр.Вид = Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Получатель;
		
	КонецЦикла; 
	// --- 
	Для каждого СА Из СП.Получатели_Копии Цикл
		
		Нстр = ПисьмоОбъект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,СА);
		Нстр.Вид = Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Копия;
		
	КонецЦикла; 
	// --- 
	Для каждого СА Из СП.Получатели_СкрытыеКопии Цикл
		
		Нстр = ПисьмоОбъект.Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,СА);
		Нстр.Вид = Перечисления.CW_ВидыПолучателейЭлектронныхПисем.СкрытаяКопия;
		
	КонецЦикла; 
	// --- 
	Для каждого СТ Из СП.Тексты Цикл
		
		Если ТипЗнч(СТ)=Тип("Строка") Тогда
			
			Нстр = ПисьмоОбъект.Тексты.Добавить();
			Нстр.Текст = СТ;
			Нстр.ТипТекста = "";
			Нстр.Кодировка = "UTF-8";
									
		ИначеЕсли ТипЗнч(СТ)=Тип("Структура") Тогда
			
			Нстр = ПисьмоОбъект.Тексты.Добавить();
			Нстр.Текст = СТ.Текст;
			Нстр.ТипТекста = _сф.ст_ПолучитьСвойство(СТ,"ТипТекста");
			Нстр.Кодировка = _сф.ст_ПолучитьСвойство(СТ,"Кодировка");
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Для каждого Вложение Из СП.Вложения Цикл
		// --- 
		
		Если Вложение.ТипАдреса = "адрес" Тогда
			
			Нстр = ПисьмоОбъект.Вложения.Добавить();
			Нстр.Вложение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Вложение.Адрес));
			Нстр.ИмяФайла = Вложение.ИмяФайла; 
			
		ИначеЕсли Вложение.ТипАдреса = "путь" Тогда 
			
			ДД = Новый ДвоичныеДанные(Вложение.Адрес);
			
			Нстр = ПисьмоОбъект.Вложения.Добавить();
			Нстр.Вложение = Новый ХранилищеЗначения(ДД);
			Нстр.ИмяФайла = Вложение.ИмяФайла; 
			
		ИначеЕсли Вложение.ТипАдреса = "ссылка" Тогда 
			
			// ничего не делаем, ссылка тут может быть только на сам объект
			
		ИначеЕсли Вложение.ТипАдреса = "Картинка" Тогда
			
			ДвоичныеДанные = Вложение.Адрес.ПолучитьДвоичныеДанные();
			
			Нстр = ПисьмоОбъект.Вложения.Добавить();
			Нстр.Вложение 			= Новый ХранилищеЗначения(ДвоичныеДанные);
			Нстр.ИмяФайла 			= Вложение.ИмяФайла; 
			Нстр.Идентификатор	 	= Вложение.Идентификатор; 
			Нстр.ЕстьИдентификатор 	= Истина; 
			
		КонецЕсли; 
				
		// --- 
	КонецЦикла;

	
	// --- 
	Возврат(ПисьмоОбъект);
	
	// --- 
КонецФункции

// формирует письмо по структуре письма или по справочнику "письма для отправки"
Функция СформироватьПисьмо(СП, ОтложеннаяОтправка = Ложь) Экспорт 
	// --- 
	
	Если ТипЗнч(СП) = Тип("Структура") Тогда
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		// --- 
		Письмо.Кодировка = СП.Кодировка;
		Письмо.Важность = ВажностьИнтернетПочтовогоСообщения[Строка(СП.Важность)];//СП.Важность;
		
		_сф.УстановитьПоУсловию(Письмо.Категории,СП.Категории);
		// --- 
		Письмо.Отправитель.Адрес = СП.Отправитель.ПочтовыйАдрес;
		Письмо.Отправитель.ОтображаемоеИмя = СП.Отправитель.ИмяОтправителя;
		// --- 
		Для каждого СА Из СП.ОбратныеАдреса Цикл
			Адрес = Письмо.ОбратныйАдрес.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
		КонецЦикла; 
		Для каждого СА Из СП.Получатели Цикл
			Адрес = Письмо.Получатели.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
		КонецЦикла; 
		Для каждого СА Из СП.Получатели_Копии Цикл
			Адрес = Письмо.Копии.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
		КонецЦикла; 
		Для каждого СА Из СП.Получатели_СкрытыеКопии Цикл
			Адрес = Письмо.СлепыеКопии.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
		КонецЦикла;
		// --- 
		Письмо.Тема = СП.Тема;
			
		// ---------------------------------------------------------------------------- 
		Для каждого Вложение Из СП.Вложения Цикл
			
			Если Вложение.ТипАдреса = "адрес" Тогда
				
				Письмо.Вложения.Добавить(ПолучитьИзВременногоХранилища(Вложение.Адрес), Вложение.ИмяФайла); 
				
			ИначеЕсли Вложение.ТипАдреса = "путь" Тогда 
				
				Письмо.Вложения.Добавить(Вложение.Адрес, Вложение.ИмяФайла); 
				
			ИначеЕсли Вложение.ТипАдреса = "ссылка" Тогда 
				
				Письмо.Вложения.Добавить(Вложение.Адрес, Вложение.ИмяФайла);
				
			КонецЕсли; 
			
		КонецЦикла;

		
		// ---------------------------------------------------------------------------- 
		Для каждого СтрТекст Из СП.Тексты Цикл
			
			Если ТипЗнч(СтрТекст)=Тип("Строка") Тогда
				
				Текст = Письмо.Тексты.Добавить(СтрТекст);
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
				Текст.Кодировка = "UTF-8";
				
			ИначеЕсли ТипЗнч(СтрТекст)=Тип("Структура") Тогда
				
				Текст = Письмо.Тексты.Добавить(СтрТекст.Текст);
				Кодировка = _сф.ст_ПолучитьСвойство(СтрТекст,"Кодировка");
				Текст.Кодировка = ?(Кодировка=Неопределено ИЛИ Кодировка="","UTF-8",Кодировка);
				Текст.ТипТекста = ТипТекстаПисьма(_сф.ст_ПолучитьСвойство(СтрТекст, "ТипТекста", ТипТекстаПочтовогоСообщения.ПростойТекст));
				
			КонецЕсли; 
			
		КонецЦикла; 
		// ---------------------------------------------------------------------------- 
		Письмо.ОбработатьТексты();
		
		Возврат(Письмо);
		
	КонецЕсли; 
	
	Если ТипЗнч(СП) = Тип("СправочникСсылка.CW_ЭлектронныеПисьмаДляОтправки")
		ИЛИ ТипЗнч(СП) = Тип("СправочникОбъект.CW_ЭлектронныеПисьмаДляОтправки") Тогда
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		// --- 
		Письмо.Кодировка = "UTF-8";
		Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
		// --- 
		Письмо.Отправитель.Адрес = СП.Отправитель.ПочтовыйАдрес;
		Письмо.Отправитель.ОтображаемоеИмя = СП.Отправитель.ИмяОтправителя;
		// --- 
		Для каждого СА Из СП.Получатели.Выгрузить(_сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Получатель)) Цикл
			
			Адрес = Письмо.Получатели.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
			
		КонецЦикла;
		Для каждого СА Из СП.Получатели.Выгрузить(_сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Копия)) Цикл
			
			Адрес = Письмо.Копии.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
			
		КонецЦикла;
		Для каждого СА Из СП.Получатели.Выгрузить(_сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.СкрытаяКопия)) Цикл
			
			Адрес = Письмо.СлепыеКопии.Добавить(СА.Адрес);
			Адрес.ОтображаемоеИмя = СА.ОтображаемоеИмя;
			
		КонецЦикла;
		// --- 
		Письмо.Тема = СП.Тема;
		
		//Выполяем замену картинок на локальные ссылки
		ВремВложения = СП.Вложения.Выгрузить();
		СоответствиеЛокальныхФайлов = новый Соответствие;
		Отбор = Новый Структура("ЕстьИдентификатор", истина);
		мСтроки = ВремВложения.НайтиСтроки(Отбор);
		Для Каждого СтрокаВложений из мСтроки Цикл
			ДвоичныеДанные 		= СтрокаВложений.Вложение.Получить();
			ИмяВременогофайла 	= ПолучитьИмяВременногоФайла();
			ДвоичныеДанные.Записать(ИмяВременогофайла);
			
			СоответствиеЛокальныхФайлов.Вставить(СтрокаВложений.Идентификатор, ИмяВременогофайла);
			
			ВремВложения.Удалить(СтрокаВложений);
		КонецЦикла;
		
		
		// ----------------------------------------------------------------------------  
		Для каждого СтрТекст Из СП.Тексты Цикл
			
			Текст = СтрТекст.Текст;
			Если СтрТекст.ТипТекста = "HTML" Тогда
				Для Каждого ЭлементСоответствия из СоответствиеЛокальныхФайлов Цикл
					Текст = СтрЗаменить(Текст,ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение);
				КонецЦикла;
			КонецЕсли;

			Текст = Письмо.Тексты.Добавить(Текст);
			ТипТекста = СтрТекст.ТипТекста;
			Текст.ТипТекста = ?(СокрЛП(ТипТекста)="",ТипТекстаПочтовогоСообщения.ПростойТекст,ТипТекстаПисьма(ТипТекста)); 
			Кодировка = СтрТекст.Кодировка;
			Текст.Кодировка = ?(СокрЛП(Кодировка)="","UTF-8",Кодировка);
			
		КонецЦикла; 
		// ---------------------------------------------------------------------------- 
		Для каждого Вложение Из ВремВложения Цикл
			Письмо.Вложения.Добавить(Вложение.Вложение.Получить(), Вложение.ИмяФайла); 
		КонецЦикла;
		// ---------------------------------------------------------------------------- 
		
		Письмо.ОбработатьТексты();

		Возврат(Письмо);
		
	КонецЕсли; 
		
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

// заполняет получателей в структуре письма по таблице Вид-Адрес-ОтображаемоеИмя
Процедура ЗаполнитьПолучателейПоТаблице(СП,ТаблицаПолучателей) Экспорт 
	// --- 
	
	// получатели
	// ---------------------------------------------------------------------------- 
	Отбор = _сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Получатель);
	Строки = _сф.к_НайтиСтроки(ТаблицаПолучателей,Отбор);
	Если Строки <> Неопределено Тогда
		
		Для каждого Стр Из Строки Цикл
			
			Если СокрЛП(Стр.Адрес) <> "" Тогда
				
				СП.Получатели.Добавить(СтруктураАдреса(Стр.Адрес,Стр.ОтображаемоеИмя));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// копии
	// ---------------------------------------------------------------------------- 
	Отбор = _сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Копия);
	Строки = _сф.к_НайтиСтроки(ТаблицаПолучателей,Отбор);
	Если Строки <> Неопределено Тогда
		
		Для каждого Стр Из Строки Цикл
			
			Если СокрЛП(Стр.Адрес) <> "" Тогда
				
				СП.Получатели_Копии.Добавить(СтруктураАдреса(Стр.Адрес,Стр.ОтображаемоеИмя));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// скрытие копии
	// ---------------------------------------------------------------------------- 
	Отбор = _сф.ст_Отбор("Вид",Перечисления.CW_ВидыПолучателейЭлектронныхПисем.СкрытаяКопия);
	Строки = _сф.к_НайтиСтроки(ТаблицаПолучателей,Отбор);
	Если Строки <> Неопределено Тогда
		
		Для каждого Стр Из Строки Цикл
			
			Если СокрЛП(Стр.Адрес) <> "" Тогда
				
				СП.Получатели_СкрытыеКопии.Добавить(СтруктураАдреса(Стр.Адрес,Стр.ОтображаемоеИмя));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// добавляет адреса из строки в массив получателей
Процедура ДобавитьПолучателейИзСтроки(МассивПолучателей,Знач СтрокаАдресов) Экспорт 
	// --- 
	
	СтрокаАдресов = СтрЗаменить(СтрокаАдресов,";",","); // для поддержки ";" в качестве разделителя
	
	МассивАдресов = _сф.м_СоздатьИзСтроки(СтрокаАдресов,",");
	Для каждого Адрес Из МассивАдресов Цикл
		
		СА = СтруктураАдресаПоСтроке(Адрес);
		Если СокрЛП(СА.Адрес) <> "" Тогда
			
			МассивПолучателей.Добавить(СА);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// удаляет запрещенные символы из имен файлов
Функция УдалитьЗапрещенныеСимволы(Знач ОригТекст) Экспорт 
	
	Текст = ОригТекст;
	текст = СтрЗаменить(Текст, "/", "_");
	текст = СтрЗаменить(Текст, "\", "_");
	текст = СтрЗаменить(Текст, ":", "_");
	текст = СтрЗаменить(Текст, "*", "_");
	текст = СтрЗаменить(Текст, "?", "_");
	текст = СтрЗаменить(Текст, """", "_");
	текст = СтрЗаменить(Текст, "<", "_");
	текст = СтрЗаменить(Текст, ">", "_");
	текст = СтрЗаменить(Текст, "|", "_");
	Возврат(Текст);
	
КонецФункции

// добавляет к структуре письма текст
Процедура ДобавитьТекст(СП,Текст,ТипТекста="HTML",Кодировка="UTF-8") Экспорт 

	СТ = _сф.ст_Создать("Текст,ТипТекста,Кодировка");
	СТ.Текст 		= Текст;
	СТ.ТипТекста 	= ?(ТипТекста = Неопределено, "HTML" ,ТипТекста);;
	СТ.Кодировка 	= ?(Кодировка = Неопределено, "UTF-8",Кодировка);;
	
	СП.Тексты.Добавить(СТ);
	
КонецПроцедуры

// добавляет к структуре письма вложение
Процедура ДобавитьВложение(СП, ИмяФайла, ТипАдреса, Адрес, Идентификатор=Неопределено) Экспорт 
	// --- 
	
	// тип адреса: адрес(вр.хр.), навигационная ссылка или путь(относительно сервера) : адрес/ссылка/путь
	// адрес - адрес во временном хранилище, навигационная ссылка или путь
	
	СтруктураФайла = _сф.ст_Создать("ИмяФайла,ТипАдреса,Адрес,Идентификатор");
	СтруктураФайла.ИмяФайла 		= УдалитьЗапрещенныеСимволы(ИмяФайла);
	СтруктураФайла.ТипАдреса 		= ТипАдреса;
	СтруктураФайла.Адрес 			= Адрес;
	СтруктураФайла.Идентификатор 	= Идентификатор;
	
	СП.Вложения.Добавить(СтруктураФайла);
	
	// --- 
КонецПроцедуры

// возвращает системный тип текста
Функция ТипТекстаПисьма(ТипСтрокой)
	// --- 
	
	Если НРег(ТипСтрокой)="plaintext" Тогда
		
		Возврат(ТипТекстаПочтовогоСообщения.ПростойТекст);
		
	ИначеЕсли НРег(ТипСтрокой)="richtext" Тогда		
		
		Возврат(ТипТекстаПочтовогоСообщения.РазмеченныйТекст);
		
	ИначеЕсли НРег(ТипСтрокой)="html" Тогда		
		
		Возврат(ТипТекстаПочтовогоСообщения.HTML);
		
	Иначе
		
		Возврат ТипТекстаПочтовогоСообщения.ПростойТекст;
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// структура адреса по двум 
Функция СтруктураАдреса(Адрес,ОтображаемоеИмя="")
	// --- 
	
	Возврат(Новый Структура("Адрес,ОтображаемоеИмя",Адрес,ОтображаемоеИмя));
	
	// --- 
КонецФункции

// возвращает строку адреса по структуре адреса
Функция СтрокаАдресаПоСтруктуре(СА) Экспорт 
	// --- 
	
	// СА - структура адреса
	
	Имя = _сф.ст_ПолучитьСвойство(СА,"ОтображаемоеИмя");
	
	Если Имя = Неопределено Тогда
		
		Возврат(СА.Адрес);
		
	Иначе
		
		Если СокрЛП(Имя)="" Тогда
			
			Возврат(СА.Адрес);
			
		Иначе
			
			Возврат(СокрЛП(Имя)+" "+"<"+СокрЛП(СА.Адрес)+">");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// Возвращает структуру адреса по строке вида "Отображаемое имя <адрес>"
Функция СтруктураАдресаПоСтроке(Знач Адрес) Экспорт 
	// --- 
	Адрес = СокрЛП(Адрес);
	строки = СтрЗаменить(Адрес,"<",Символы.ПС);
	Если _сф.стр_ЧислоСтрок(строки) > 1 Тогда
		
		Представление = СтрПолучитьСтроку(Строки,1);
		АдресПочты = СокрЛП(СтрЗаменить(СтрПолучитьСтроку(строки,2),">",""));
		
	Иначе
		
		Представление = "";
		АдресПочты = СокрЛП(Адрес);
		
	КонецЕсли; 
	
	Возврат(СтруктураАдреса(АдресПочты,Представление));
	
	// --- 
КонецФункции

Функция МассивАдресовПоСтроке(Строка,Разделитель=",") Экспорт 
	// --- 
	
	МассивАдресов = Новый Массив;
	МассивСтрок = _сф.м_СоздатьИзСтроки(Строка,Разделитель);
	Для каждого СтрокаАдреса Из МассивСтрок Цикл
		
		МассивАдресов.Добавить(СтруктураАдреса(СтрокаАдреса));
		
	КонецЦикла; 
	
	Возврат(МассивАдресов);
	
	// --- 
КонецФункции

// получает параметры пользователя
Функция ПолучитьУчетнуюЗаписьТекущегоПользователя() Экспорт
	
	ТекущийПользователь = CW_Настройки.Пользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПараметрыПользователей.УчетнаяЗаписьЭлектроннойПочты КАК УчетнаяЗаписьЭлектроннойПочты
	               |ИЗ
	               |	РегистрСведений.CW_НастройкиПользователей КАК ПараметрыПользователей
	               |ГДЕ
	               |	ПараметрыПользователей.Пользователь = &Пользователь
	               |	И ПараметрыПользователей.УчетнаяЗаписьЭлектроннойПочты <> Значение(Справочник.CW_УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УчетнаяЗаписьЭлектроннойПочты;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// ----------------------------------------------------------------------------  

Функция ОтправитьПисьмо(Письмо) Экспорт 
	
	Если ЭтоАдресВременногоХранилища(Письмо) Тогда
		
		СП = ПолучитьИзВременногоХранилища(Письмо);
		
	Иначе
		
		СП = Письмо;
		
	КонецЕсли; 
	
	// --- 
	
	Если (Константы.CW_СкрытаяКопияДляВсехПисем.Получить()) Тогда
		
		АдресаСтрокой = Константы.CW_АдресаСкрытыхКопийДляВсехПисем.Получить();
		Если (ЗначениеЗаполнено(АдресаСтрокой)) Тогда
			
			АдресаСтрокой = СтрЗаменить(АдресаСтрокой,";",",");
			МассивАдресов = _сф.м_СоздатьИзСтроки(АдресаСтрокой,",");
			Для каждого Стр Из МассивАдресов Цикл
				
				Письмо.Получатели_СкрытыеКопии.Добавить(СтруктураАдресаПоСтроке(Стр));
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	
	ИспользуетсяОчередь = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОчередиНаОтправку");
	
	// --- 
	
	Если ИспользуетсяОчередь Тогда
		
		// записываем письмо в очередь
		Возврат(ДобавитьПисьмоВОчередь(СП));
		
	Иначе
		
		// отправляем сразу
		Попытка
			
			Сообщение 		= СформироватьПисьмо(СП);
		
			Почта = Новый ИнтернетПочта;
			Почта.Подключиться(ПолучитьПрофильSMTP(СП.Отправитель));
			
			ОтветСервера 	= Почта.Послать(Сообщение);
			
			Если ОтветСервера.Количество() > 0 Тогда
				
				мОшибочныеАдреса = новый Массив;
				Для Каждого ЭлементСтруктуры из ОтветСервера Цикл
					СообщениеОбОшибке = Новый СообщениеПользователю;
				    СообщениеОбОшибке.Текст = ЭлементСтруктуры.Значение;
					СообщениеОбОшибке.Сообщить();
					мОшибочныеАдреса.Добавить(ЭлементСтруктуры.Ключ);
				КонецЦикла;
				
				Почта.Отключиться();
				
				СписокАдресов 	= СтрСоединить(мОшибочныеАдреса,",");
				ТекстОшибки 	= "Не удалось отправить письмо по одному или некоторым из указанных адресов: "+СписокАдресов;
				
				CW_Журнал.ЗаписатьСообщение("Общие.ОтправкаПочты","error",ТекстОшибки);

				Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
			КонецЕсли;
			
			Почта.Отключиться();   
			
			Если СП.Отправитель.СохранятьОтправленныеПисьма 
				И ЗначениеЗаполнено(СП.Отправитель.АдресСервераIMAP) Тогда 
				
				Попытка                              
					
					ПрофильIMAP = ПолучитьПрофильIMAP(СП.Отправитель);
					
					ИнтернетПочта = Новый ИнтернетПочта;
					ИнтернетПочта.Подключиться(ПрофильIMAP, ПротоколИнтернетПочты.IMAP);
					ИнтернетПочта.ТекущийПочтовыйЯщик = "Отправленные";
					ИнтернетПочта.Послать(Сообщение,, ПротоколИнтернетПочты.IMAP);
					ИнтернетПочта.Отключиться();  
					
				Исключение 
					ЗаписьЖурналаРегистрации("Отппавка почты IMAP",УровеньЖурналаРегистрации.Информация,,,ОписаниеОшибки());
				КонецПопытки;  	
				
			КонецЕсли;

			Возврат(_УФКС.Ответ(0));
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			CW_Журнал.ЗаписатьСообщение("Общие.ОтправкаПочты","error",ТекстОшибки);
			
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецФункции

Функция ДобавитьПисьмоВОчередь(Письмо) Экспорт 
	// --- 
	
	Попытка
		
		ПисьмоОбъект = ПисьмоОбъектПоСтруктуре(Письмо);
		ПисьмоОбъект.Записать();
		
		РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ЗаписатьСтатусОбработки(ПисьмоОбъект.Ссылка, ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание"));
		
		Возврат(_УФКС.Ответ(2));
		
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 
// РЕГЛАМЕНТНЫЕ ЗАДАНИЯ

// ---------------------------------------------------------------------------- 
// РЗ: Получение почты

Функция ПолучитьПисьмаДляОбработки() Экспорт 
	// --- 
	
	// получаем активные выборки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФильтрыЭлектронныхПисем.УчетнаяЗапись,
	|	ФильтрыЭлектронныхПисем.Критерий
	|ИЗ
	|	Справочник.CW_ФильтрыЭлектронныхПисем КАК ФильтрыЭлектронныхПисем
	|ГДЕ
	|	ФильтрыЭлектронныхПисем.Активность = ИСТИНА";
	ТЗ = Запрос.Выполнить().Выгрузить();
	СписокУчетныхЗаписей = _сф.сп_СоздатьИзКолонкиТЗ(ТЗ,"УчетнаяЗапись");  
	
	Для каждого УчетнаяЗапись Из СписокУчетныхЗаписей.ВыгрузитьЗначения() Цикл
		
		Попытка
			
			// получаем критерии
			ТЗК = ТЗ.Скопировать(Новый Структура("УчетнаяЗапись",УчетнаяЗапись));
			МассивКритериев = _сф.м_СоздатьИзКолонкиТЗ(ТЗК,"Критерий");
			// --- 
			
			// подключаемся к серверу, читаем заголовки
			ИнтернетПочта = Новый ИнтернетПочта;
			Попытка
				ИПП = ПолучитьПрофильPOP3(УчетнаяЗапись);
				ИнтернетПочта.Подключиться(ИПП);
			Исключение
				//ОписаниеОшибки()
				// тут необходимо сделать запись в некий журнал сообщений
				ВызватьИсключение "Ошибка подключения:"+ОписаниеОшибки();
				
			КонецПопытки; 
			// --- 
			МассивЗаголовков = ИнтернетПочта.ПолучитьЗаголовки();
			ТаблицаЗагружаемыхПисем = _сф.т_Создать("Заголовок,Критерий,Идентификатор,СтатусЗагрузки");
			
			// проверяем
			Для каждого Заголовок Из МассивЗаголовков Цикл
				
				Для каждого Критерий Из МассивКритериев Цикл
					
					Если СоответствиеКритерию(Заголовок,Критерий) Тогда
						
						Нстр = ТаблицаЗагружаемыхПисем.Добавить();
						Нстр.Заголовок = Заголовок;
						Нстр.Критерий = Критерий;
						Нстр.Идентификатор = Заголовок.ИдентификаторСообщения;
						Нстр.СтатусЗагрузки = Ложь;
						Продолжить;
						
					КонецЕсли;
					
				КонецЦикла; // цикл критериев
				
			КонецЦикла; // цикл заголовков
			
			// --- 
			
			// получаем
			МассивСообщений = ИнтернетПочта.Выбрать(Ложь,_сф.м_СоздатьИзКолонкиТЗ(ТаблицаЗагружаемыхПисем,"Заголовок"));
			МассивКУдалению = Новый Массив;
			
			
			// записываем
			Для каждого Сообщение Из МассивСообщений Цикл
				// --- 
				
				Попытка
					
					//Сообщение = Новый ИнтернетПочтовоеСообщение; // тмп
					// ищем критерий отбора по идентификатору письма
					СтрокаПисьма = ТаблицаЗагружаемыхПисем.Найти(Сообщение.ИдентификаторСообщения,"Идентификатор");
					Если СтрокаПисьма=Неопределено Тогда
						
						// ахтунг
						Продолжить;
						
					КонецЕсли; 
					
					
					ПисьмоОбъект = Справочники.CW_ЭлектронныеПисьмаДляОбработки.СоздатьЭлемент();
					ПисьмоОбъект.Отправитель = Сообщение.Отправитель.Адрес;
					СписокАдресовПолучателей = Новый СписокЗначений;
					Для каждого Адрес Из Сообщение.Получатели Цикл
						
						СписокАдресовПолучателей.Добавить(СтрокаАдресаПоСтруктуре(СтруктураАдреса(Адрес.Адрес,Адрес.ОтображаемоеИмя)));
						
					КонецЦикла; 
					ПисьмоОбъект.Получатель = _сф.сп_Представление(СписокАдресовПолучателей,",",Ложь);
					ПисьмоОбъект.ДатаОтправления = Сообщение.ДатаОтправления;
					ПисьмоОбъект.ДатаПолучения = Сообщение.ДатаПолучения;
					ПисьмоОбъект.ИдентификаторСообщения = Сообщение.ИдентификаторСообщения;
					ПисьмоОбъект.Тема = Сообщение.Тема;
					// --- 
					Сообщение.ОбработатьТексты();
					КолвоХМЛ=0;
					Для каждого Текст Из Сообщение.Тексты Цикл
						
						Если Найти(НРег(Текст.Текст),"<?xml version") > 0 Тогда
							_сф.Инкремент(КолвоХМЛ); 
							ИмяФайла = СтрЗаменить(Сообщение.Тема,"/","_");
							ИмяФайла = СтрЗаменить(ИмяФайла,":","");
							ИмяФайла = СтрЗаменить(ИмяФайла,"\","_")+КолвоХМЛ+".xml";
							
							Нстр = ПисьмоОбъект.Вложения.Добавить();
							Нстр.ИмяФайла = ИмяФайла;
							Нстр.Расширение = _сф.ф_РасширениеФайла(Нстр.ИмяФайла); // получаем расширение по имени
							Нстр.MIME = " text/xml";
							Нстр.Вложение = Новый ХранилищеЗначения(Текст.Данные);
							
						КонецЕсли;
						
						Нстр = ПисьмоОбъект.Тексты.Добавить();
						Нстр.ТипТекста = Текст.ТипТекста;
						Нстр.Кодировка = Текст.Кодировка;
						Нстр.Текст = Текст.Текст;
						Нстр.ДД = Новый ХранилищеЗначения(Текст.Данные);
						
					КонецЦикла; 
					// --- 
					Для каждого Вложение Из Сообщение.Вложения Цикл
						
						Нстр = ПисьмоОбъект.Вложения.Добавить();
						Нстр.ИмяФайла = Вложение.Имя;
						Нстр.Расширение = _сф.ф_РасширениеФайла(Нстр.ИмяФайла); // получаем расширение по имени
						Нстр.MIME = Вложение.ТипСодержимого;
						Нстр.Вложение = Новый ХранилищеЗначения(Вложение.Данные);
						Нстр.Размер = Вложение.Данные.Размер();
						
					КонецЦикла;
					
					// --- 
					
					ПисьмоОбъект.КритерийОтбора = СтрокаПисьма.Критерий;
					ПисьмоОбъект.Записать();
					
					СтатусОбработки = ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание");;
					РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ЗаписатьСтатусОбработки(ПисьмоОбъект.Ссылка, СтатусОбработки); 
					
					МассивКУдалению.Добавить(Сообщение);
					
					// --- 
					СтрокаПисьма.СтатусЗагрузки = Истина;
					
				Исключение
					// ничего не делаем, сообщение всё ешё помечено как незагруженное
				КонецПопытки; 
				// --- 
			КонецЦикла; // цикл записи сообщений
			
			// --- 
			
			Если МассивКУдалению.Количество() <> 0 Тогда
				
				Для каждого Стр Из МассивКУдалению Цикл
					
					ВМ = Новый Массив;
					ВМ.Добавить(Стр.Идентификатор[0]);
					ИнтернетПочта.Выбрать(Истина,ВМ);
					
				КонецЦикла; 
				
			КонецЕсли; 
			
			// --- 
			ИнтернетПочта.Отключиться();
			// --- 
			
		Исключение
			
			CW_Журнал.ЗаписатьСообщение("Общие.РегламентноеПолучениеПочты","error",Строка(УчетнаяЗапись)+":"+Символы.ПС+ОписаниеОшибки());
			
		КонецПопытки; 
		
	КонецЦикла; // цикл учетных записей 
	
	
	// --- 
КонецФункции

Функция СоответствиеКритерию(Заголовок,Критерий)
	// --- 
	
	// простой вариант
	// формируем список результатов выражений
	
	ТЗ = _сф.т_Создать("Результат,Объединение");
	
	Попытка
		
		Для каждого СтрУсловие Из Критерий.Условия Цикл
			
			Нстр = ТЗ.Добавить();
			
			Если СтрУсловие.Реквизит = "Отправитель" Тогда
				
				РеквизитЗаголовка = Заголовок.Отправитель.Адрес;
				
			ИначеЕсли СтрУсловие.Реквизит = "Тема" Тогда 
				
				РеквизитЗаголовка = Заголовок.Тема;
				
			КонецЕсли; 
			
			Если СтрУсловие.ТипСравнения=Перечисления.CW_ТипыСравнения.Равно Тогда
				
				Нстр.Результат = (РеквизитЗаголовка=СокрЛП(СтрУсловие.Значение));
				
			ИначеЕсли СтрУсловие.ТипСравнения=Перечисления.CW_ТипыСравнения.Содержит Тогда 
				
				Нстр.Результат =  ?(Найти(РеквизитЗаголовка,СокрЛП(СтрУсловие.Значение))=0,Ложь,Истина);
				
			КонецЕсли; 
			
			Нстр.Объединение = СтрУсловие.Объединение; 
			
		КонецЦикла; 
		
	Исключение
		Возврат(Ложь);
	КонецПопытки; 
	
		
	// теперь формируем строку для вычисления
	
	ЛогическаяСтрока = "";
	Для каждого Стр Из ТЗ Цикл
		
		ПредставлениеОбъединения = "";
		Если Стр.Объединение = Перечисления.CW_ТипыОбъединения.И Тогда
			
			ПредставлениеОбъединения="И";
			
		ИначеЕсли Стр.Объединение = Перечисления.CW_ТипыОбъединения.ИЛИ Тогда 
			
			 ПредставлениеОбъединения="ИЛИ";
			
		КонецЕсли; 
		
		ЛогическаяСтрока = ЛогическаяСтрока+?(Стр.Результат,"Истина","Ложь")+" "+ПредставлениеОбъединения+" ";
				
	КонецЦикла; 
	
	// вычисляем
	
	Результат = Ложь;
	Выполнить("Результат="+ЛогическаяСтрока+";");
	
	Возврат(Результат);
	
	
	// --- 
КонецФункции

// ----------------------------------------------------------------------------
// РЗ: обработка полученной почты

// обработка очереди писем
Процедура ОбработатьПисьма() Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	// тут необходимо проверить, не запущено ли задание
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронныеПисьмаДляОбработки.Ссылка,
	               |	ЭлектронныеПисьмаДляОбработки.КритерийОтбора
	               |ИЗ
	               |	Справочник.CW_ЭлектронныеПисьмаДляОбработки КАК ЭлектронныеПисьмаДляОбработки
	               |ГДЕ
	               |	ЭлектронныеПисьмаДляОбработки.СтатусОбработки = &СтатусОбработки
	               |	И ЭлектронныеПисьмаДляОбработки.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭлектронныеПисьмаДляОбработки.ДатаПолучения";
	Запрос.УстановитьПараметр("СтатусОбработки", Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	МассивКритериев = _сф.м_СоздатьИзКолонкиТЗ(ТЗ,"КритерийОтбора");
	СоответствиеОбработок = Новый Соответствие;
	Для каждого Критерий Из МассивКритериев Цикл
		
		СоответствиеОбработок.Вставить(Критерий,_ПО.ПолучитьОбработку(Критерий.Обработка));
		
	КонецЦикла; 
	
	// --- 
	
	Для каждого Стр Из ТЗ Цикл
		
		Попытка
			
			Если Стр.КритерийОтбора.Пустая() Тогда
				
				ВызватьИсключение "Не указан критерий!";
				
			КонецЕсли; 
			
			Обработка = СоответствиеОбработок.Получить(Стр.КритерийОтбора);
			Ответ = Обработка.ОбработатьСообщение(Стр.Ссылка);
			Если Ответ.Код <> 0 Тогда
				
				Попытка
					
					Справочники.CW_СистемныеСообщения.Добавить("Обработка писем","("+Строка(Стр.КритерийОтбора)+")("+_сф.нс_Обернуть(Стр.Ссылка)+") "+Ответ.ОписаниеОшибки);
					
					// устанавливаем статус письма
					Письмо = Стр.Ссылка.ПолучитьОбъект();
					Письмо.СтатусОбработки = _СФ.ст_ПолучитьСвойство(Ответ, "СтатусОбработки", Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Завершено);
					Письмо.Записать();
					
				Исключение
					Справочники.CW_СистемныеСообщения.Добавить("Обработка писем","("+Строка(Стр.КритерийОтбора)+")("+_сф.нс_Обернуть(Стр.Ссылка)+") "+ОписаниеОшибки());					
				КонецПопытки; 
				
			Иначе
				
				Попытка
					
					// устанавливаем статус письма
					Письмо = Стр.Ссылка.ПолучитьОбъект();
					Письмо.СтатусОбработки = Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Завершено;
					Письмо.Записать();
					
				Исключение
					Справочники.CW_СистемныеСообщения.Добавить("Обработка писем","("+Строка(Стр.КритерийОтбора)+")("+_сф.нс_Обернуть(Стр.Ссылка)+") "+ОписаниеОшибки());
				КонецПопытки; 
				
			КонецЕсли; 
			
		Исключение
			
			Справочники.CW_СистемныеСообщения.Добавить("Обработка писем","("+Строка(Стр.КритерийОтбора)+")("+_сф.нс_Обернуть(Стр.Ссылка)+") "+ОписаниеОшибки());
			// --- 
			Попытка
				
				// устанавливаем статус письма
				Письмо = Стр.Ссылка.ПолучитьОбъект();
				Письмо.СтатусОбработки = Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки;
				Письмо.Записать();
				
			Исключение
			    Справочники.CW_СистемныеСообщения.Добавить("Обработка писем","("+Строка(Стр.КритерийОтбора)+")("+_сф.нс_Обернуть(Стр.Ссылка)+") "+ОписаниеОшибки());
			КонецПопытки; 
						
		КонецПопытки; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 
// РЗ: удаление успешно обработанной почты

// регламент пометки на удаление успешно загруженных старше 24 часов
Функция ПометитьНаУдалениеУспешноЗагруженные() Экспорт 
	// --- 
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЭлектронныеПисьмаДляОбработки.Ссылка,
		|	ЭлектронныеПисьмаДляОбработки.ДатаПолучения
		|ИЗ
		|	Справочник.CW_ЭлектронныеПисьмаДляОбработки КАК ЭлектронныеПисьмаДляОбработки
		|ГДЕ
		|	ЭлектронныеПисьмаДляОбработки.СтатусОбработки = &СтатусОбработки
		|	И ЭлектронныеПисьмаДляОбработки.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("СтатусОбработки", Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Завершено);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		МассивСообщений = Новый Массив;
		
		ТД=ТекущаяДата();
		
		Для каждого Стр Из ТЗ Цикл
			
			// --- 
			
			Если (ТД-Стр.ДатаПолучения) > 60*60*24 Тогда
				
				Попытка
					
					ПисьмоОбъект = Стр.Ссылка.ПолучитьОбъект();
					ПисьмоОбъект.УстановитьПометкуУдаления(Истина);
					
				Исключение
					
					МассивСообщений.Добавить("Ошибка удаления письма "+ПолучитьНавигационнуюСсылку(Стр.Ссылка));
					
				КонецПопытки; 
								
			КонецЕсли; 			
			
			// --- 
			
		КонецЦикла; 
		
		Если МассивСообщений.Количество() <> 0 Тогда
			
			ТекстСообщения = "Ошибки обработки:";
			Для каждого СообщениеМассива Из МассивСообщений Цикл
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + СообщениеМассива;
				
			КонецЦикла; 
			CW_Журнал.ЗаписатьСообщение("Общие.УдалениеЗагруженныхПисем","error",ТекстСообщения);
			
		КонецЕсли; 
		
	Исключение
		
		CW_Журнал.ЗаписатьСообщение("Общие.УдалениеЗагруженныхПисем","error","Ошибка обработки:"+Символы.ПС+ОписаниеОшибки());
		
	КонецПопытки; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 
// РЗ: отправка писем из очереди

Процедура ОтправитьПочту(ПараметрыПроцедуры=Неопределено, АдресРезультата=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// проверяем очередь отправки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо.Отправитель КАК Отправитель,
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо.Дата КАК Дата,
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо КАК Ссылка,
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо.СсылкаНаОбъект КАК СсылкаНаОбъект
	               |ИЗ
	               |	РегистрСведений.CW_СтатусОбработкиЭлектронныхПисем КАК CW_СтатусОбработкиЭлектронныхПисем
	               |ГДЕ
	               |	CW_СтатусОбработкиЭлектронныхПисем.СтатусОбработки в (&мСтатусОбработки)
	               |	И CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |ИТОГИ ПО
	               |	Отправитель
	               |АВТОУПОРЯДОЧИВАНИЕ";    
	
	мСтатусОбработки = Новый Массив;
	мСтатусОбработки.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание"));
	мСтатусОбработки.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки"));
	
	Запрос.УстановитьПараметр("мСтатусОбработки", мСтатусОбработки);
	
	РезультатЗапроса  = Запрос.Выполнить();
	
	ВыборкаОтправитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	мОбъектыКУдалению = Новый Массив;
	Пока ВыборкаОтправитель.Следующий() Цикл
		
		Попытка
			// подключаемся
			Почта = Новый ИнтернетПочта;
			Почта.Подключиться(ПолучитьПрофильSMTP(ВыборкаОтправитель.Отправитель));
		Исключение
			CW_Журнал.ЗаписатьСообщение("Общие.ОтправкаПочты","error","Ошибка при отправке почты: "+ОписаниеОшибки());
			Продолжить;
		КонецПопытки; 
		
		МассивСообщений = Новый Массив;
		
		ВыборкаДетали = ВыборкаОтправитель.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			Попытка
				Письмо = СформироватьПисьмо(ВыборкаДетали.Ссылка);
			Исключение
				CW_Журнал.ЗаписатьСообщение("Общие.ОтправкаПочты","error","Формирование объекта по письму на отправку:"+Символы.ПС+ОписаниеОшибки());
				Продолжить;
			КонецПопытки; 
			
			Попытка
				Почта.Послать(Письмо);
				СтатусОбработки = ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Завершено");
				ЗаписатьДанныеВРегистр(ВыборкаДетали.СсылкаНаОбъект);
				мОбъектыКУдалению.Добавить(ВыборкаДетали.Ссылка);
			Исключение
				СтатусОбработки = ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки");
				МассивСообщений.Добавить("Ошибка отправки письма ("+ПолучитьНавигационнуюСсылку(ВыборкаДетали.Ссылка)+"): "+ОписаниеОшибки());
			КонецПопытки; 
			
			РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ЗаписатьСтатусОбработки(ВыборкаДетали.Ссылка, СтатусОбработки) 
		
		КонецЦикла;
		
		Если МассивСообщений.Количество() <> 0 Тогда
			ТекстУведомления = "Ошибка отправки почты учетной записи <"+Строка(ВыборкаОтправитель.Отправитель)+">";
			ТекстУведомления = ТекстУведомления +Символы.ПС+ СтрСоединить(МассивСообщений,Символы.ПС); 
			
			Справочники.CW_СистемныеСообщения.Добавить("ОтправкаПочты", ТекстУведомления);
		КонецЕсли; 
		
		// отключаемся
		Почта.Отключиться();
		
	КонецЦикла;
	
	Для каждого УдаляемаяСсылка из мОбъектыКУдалению Цикл
		ТОбъект = УдаляемаяСсылка.ПолучитьОбъект();
		ТОбъект.Удалить();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистр(СсылкаНаОбъект)
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.CW_ПризнакОтправкиПоЭлектроннойПочте.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Документ 		= СсылкаНаОбъект;
	
	ЗаписьРегистра.ДатаОтправки 	= ТекущаяДата();
	ЗаписьРегистра.СтатусОтправки 	= ПредопределенноеЗначение("Перечисление.CW_СтатусыОтправкиПоЭлектроннойПочте.Отправлено");
	
	
	ЗаписьРегистра.Записать(Истина);
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 
// РЗ: отправка уведомлений о наличие системных сообщений

Процедура СформироватьУведомленияОСистемныхСообщениях() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	// получаем непрочитанные и неотправленные системные сообщения
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СистемныеСообщения.Ссылка,
	               |	СистемныеСообщения.Дата,
	               |	СистемныеСообщения.Источник,
	               |	СистемныеСообщения.Сообщение
	               |ИЗ
	               |	Справочник.CW_СистемныеСообщения КАК СистемныеСообщения
	               |ГДЕ
	               |	СистемныеСообщения.ПометкаУдаления = ЛОЖЬ
	               |	И СистемныеСообщения.Отправлено = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СистемныеСообщения.Дата УБЫВ";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		
		// --- 
		
		// формируем письмо
		
		// проверяем, что указана системная учетная запись и адрес дежурного администратора
		СистемнаяУчетнаяЗапись = Неопределено;
		//СистемнаяУчетнаяЗапись = МенеджерНастроек.ПолучитьПараметрИС(ПланыВидовХарактеристик.НастройкиИнформационнойСистемы.СистемнаяУчетнаяЗапись);
		Если СистемнаяУчетнаяЗапись=Неопределено Тогда
			
			Справочники.CW_СистемныеСообщения.Добавить("ОтправкаПочты","Формирование уведомления о системных сообщениях: не задана системная учетная запись!");
			Возврат;
			
		КонецЕсли; 
		// --- 
		АдресАдминистратора = Неопределено;
		Если АдресАдминистратора = Неопределено Тогда
			
			Справочники.CW_СистемныеСообщения.Добавить("ОтправкаПочты","Формирование уведомления о системных сообщениях: не задана адрес дежурного администратора!");
			Возврат;
			
		КонецЕсли; 
		
		// --- 
		
		Письмо = Справочники.CW_ЭлектронныеПисьмаДляОтправки.СоздатьЭлемент();
		Письмо.Отправитель=СистемнаяУчетнаяЗапись;
		// --- 
		МассивАдресов = _ЭП.МассивАдресовПоСтроке(АдресАдминистратора);
		Для каждого Элемент Из МассивАдресов Цикл
			
			Нстр = Письмо.Получатели.Добавить();
			Нстр.Вид=Перечисления.CW_ВидыПолучателейЭлектронныхПисем.Получатель;
			Нстр.Адрес = Элемент.Адрес;
			Нстр.ОтображаемоеИмя = Элемент.ОтображаемоеИмя;
						
		КонецЦикла;
		// --- 
		
		ИдентификаторИБ = Неопределено;
		Письмо.Тема = "";
		_сф.стр_Добавить(Письмо.Тема,?(ИдентификаторИБ=Неопределено,"","["+ИдентификаторИБ+"]"));
		_сф.стр_Добавить(Письмо.Тема," Системные сообщения");
		_сф.стр_Добавить(Письмо.Тема," ("+Формат(ТЗ.Количество(),"ЧЦ=10; ЧДЦ=0")+")");
		// --- 
		
		// сформируем текст письма:
		
		ШаблонУведомления = Справочники.CW_СистемныеСообщения.ПолучитьМакет("ШаблонУведомления").ПолучитьТекст();
		ШаблонСообщения = Справочники.CW_СистемныеСообщения.ПолучитьМакет("ШаблонСообщения").ПолучитьТекст();
		
		СсылкаИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		
		ТелоСообщения="";
		Для каждого Стр Из ТЗ Цикл
			
			СодержимоеБлока = "";
			// выводим дату и тип жирной строкой,
			_сф.стр_Добавить(СодержимоеБлока,"<a href="+СсылкаИБ+"#"+ПолучитьНавигационнуюСсылку(Стр.Ссылка)+">"+Формат(Стр.Дата,"ДФ='yyyy.MM.dd HH:mm:ss'")+" : "+СокрЛП(Стр.Источник)+"</a><br/>"+Символы.ПС);
			
			// необходимо найти в теле сообщения навигационные ссылки и заменить их представление
			// ищем по критерию {}
			
			ТекстСообщения = Стр.Сообщение;
			СписокСсылок = _сф.стр_СписокМакросов(Стр.Сообщение,"{}");
			Для каждого Ссылка Из СписокСсылок Цикл
				
				ТекстСообщения = _сф.стр_Заменить(ТекстСообщения,_сф.стр_Обернуть(Ссылка,"{}"),"<a href="+СсылкаИБ+"#"+Ссылка+">"+_сф.нс_ПредставлениеСсылки(Ссылка)+"</a>");
				
			КонецЦикла; 
			
			// оставляем возможность указывать ссылки в простых скобках
			СписокСсылок = _сф.стр_СписокМакросов(Стр.Сообщение,"()");
			Для каждого Ссылка Из СписокСсылок Цикл
				
				Если Найти(Ссылка,"e1cib")=1 Тогда
					
					ТекстСообщения = _сф.стр_Заменить(ТекстСообщения,_сф.стр_Обернуть(Ссылка,"()"),"<a href="+СсылкаИБ+"#"+Ссылка+">"+_сф.нс_ПредставлениеСсылки(Ссылка)+"</a>");
					
				КонецЕсли; 
				
			КонецЦикла;
			
			
			_сф.стр_Добавить(СодержимоеБлока,ТекстСообщения+Символы.ПС);
			// подставляем в шаблон сообщения
			СодержимоеБлока = _сф.стр_Заменить(ШаблонСообщения,"%text%",СодержимоеБлока);
			_сф.стр_Добавить(ТелоСообщения,СодержимоеБлока+Символы.ПС);
			
		КонецЦикла; 
		
		// подставляем текст письма в шаблон письма
		ТелоСообщения = _сф.стр_Заменить(ШаблонУведомления,"%text%",ТелоСообщения);
		
		// --- 
		ТекстПисьма = Письмо.Тексты.Добавить();
		ТекстПисьма.Текст = ТелоСообщения;
		ТекстПисьма.ТипТекста= "html"; // richtext,html

		Письмо.Записать();
		
		// --- 
		
	КонецЕсли; 
	
	// помечаем сообщения как отправленные
	Для каждого Стр Из ТЗ Цикл
		
		Сообщение = Стр.Ссылка.ПолучитьОбъект();
		Сообщение.Отправлено = Истина;
		Сообщение.Записать();
		
	КонецЦикла; 
	
	// --- 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура CW_ЗавершениеСеанса() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры
